[
  {
    "skillId": 1,
    "skillName": "Beginner Guitar Lessons",
    "providerName": "Alex Martin",
    "providerEmail": "alex@skillswap.com",
    "price": 20,
    "rating": 4.8,
    "slotsAvailable": 3,
    "description": "Acoustic guitar classes for complete beginners.",
    "full_descriptions": "This beginner guitar lesson program is designed for absolute newcomers who have little to no experience with musical instruments. The sessions start with a clear introduction to guitar parts, tuning methods, and basic hand positioning to avoid strain or bad habits. Learners will gradually move into simple chords, smooth chord transitions, and easy strumming patterns. The teaching approach is slow-paced, friendly, and highly practical, allowing students to play simple songs within the first few classes. Regular practice guidance, finger-strength exercises, and rhythm-building techniques are included. By the end of the course, students will feel confident enough to play basic songs independently and continue learning more advanced techniques.",
    "image": "https://i.ibb.co.com/yndT5w1v/images-q-tbn-ANd9-Gc-SPEl6e-Pl-Jager-XTa-Dmj-JJ1i1bv-Lyt-Tm-KP4cg-s.jpg",
    "category": "Music"
  },
  {
    "skillId": 2,
    "skillName": "Spoken English Practice",
    "providerName": "Sarah Johnson",
    "providerEmail": "sarah@skillswap.com",
    "price": 15,
    "rating": 4.6,
    "slotsAvailable": 5,
    "description": "Improve your English speaking confidence.",
    "full_descriptions": "This spoken English practice course focuses on building confidence and fluency in everyday communication. It is ideal for students, professionals, and job seekers who understand basic English but hesitate while speaking. Sessions include real-life conversation practice, pronunciation correction, common grammar mistake identification, and vocabulary building. Learners participate in guided discussions, role-plays, and short presentations to simulate real-world scenarios. Special attention is given to accent clarity and sentence structure. The instructor provides personalized feedback and improvement strategies after each session. Over time, students develop natural speaking flow and feel more comfortable expressing their thoughts in English.",
    "image": "https://i.ibb.co.com/0RzVsnLp/course-1663654149.jpg",
    "category": "Language"
  },
  {
    "skillId": 3,
    "skillName": "Web Design with HTML & CSS",
    "providerName": "David Lee",
    "providerEmail": "david@skillswap.com",
    "price": 25,
    "rating": 4.9,
    "slotsAvailable": 4,
    "description": "Learn modern web design fundamentals.",
    "full_descriptions": "This web design course introduces learners to the core building blocks of the web using HTML and CSS. It is perfect for beginners who want to design clean and responsive websites. The lessons start with basic HTML structure, semantic tags, and best practices for accessibility. Students then move on to CSS styling, layouts using Flexbox and Grid, color theory, and responsive design techniques. Practical projects such as landing pages and portfolio layouts are included. The instructor emphasizes real-world design standards and clean code practices. By the end, learners will be able to create visually appealing websites from scratch.",
    "image": "https://i.ytimg.com/vi/Eb3lOiukwAQ/maxresdefault.jpg",
    "category": "Technology"
  },
  {
    "skillId": 4,
    "skillName": "Basic Photography Skills",
    "providerName": "Emily Carter",
    "providerEmail": "emily@skillswap.com",
    "price": 18,
    "rating": 4.5,
    "slotsAvailable": 6,
    "description": "Master camera basics and composition.",
    "full_descriptions": "This photography skill program is designed for beginners who want to understand how cameras work and how to take better photos. The course covers essential concepts such as exposure, ISO, shutter speed, and aperture in an easy-to-understand manner. Learners also explore composition techniques like the rule of thirds, framing, and lighting basics. Practical assignments help students apply theory in real-life situations using any camera or smartphone. The instructor reviews photos and provides constructive feedback. By completing the course, students gain confidence in capturing visually pleasing and well-balanced photographs.",
    "image": "https://i.ibb.co.com/hqs5BSc/images-q-tbn-ANd9-Gc-Qqs-Fbbv-Jc-KVp-SAVD6-Qtg-P7h-FOY2t-Br3t19y-A-s.jpg",
    "category": "Photography"
  },
  {
    "skillId": 5,
    "skillName": "Python Programming for Beginners",
    "providerName": "Michael Brown",
    "providerEmail": "michael@skillswap.com",
    "price": 30,
    "rating": 4.9,
    "slotsAvailable": 4,
    "description": "Start coding with Python from scratch.",
    "full_descriptions": "This Python programming course is tailored for absolute beginners who want to enter the world of coding. It begins with installing Python and understanding basic syntax, variables, and data types. Students then learn conditional statements, loops, functions, and simple problem-solving techniques. Real-life examples and small coding exercises make learning engaging and practical. The course also introduces basic file handling and simple projects to build confidence. No prior programming experience is required. By the end of the course, learners will have a strong foundation in Python and be ready to explore advanced topics.",
    "image": "https://img-c.udemycdn.com/course/750x422/5199368_3e61.jpg",
    "category": "Programming"
  },
  {
    "skillId": 6,
    "skillName": "Digital Marketing Basics",
    "providerName": "Olivia Wilson",
    "providerEmail": "olivia@skillswap.com",
    "price": 22,
    "rating": 4.4,
    "slotsAvailable": 5,
    "description": "Learn online marketing fundamentals.",
    "full_descriptions": "This digital marketing course introduces learners to the essential concepts of online promotion and brand visibility. Topics include social media marketing, content strategy, basic SEO, email marketing, and online advertising fundamentals. The course explains how businesses attract and engage customers in the digital space. Real-world examples and simple tools are used to demonstrate campaign planning and performance tracking. Learners also understand audience targeting and analytics basics. This course is ideal for small business owners, students, and beginners aiming to build a digital presence effectively.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQfV6MsRi-It9OD5sMfauZSpFvZ3MkXLFqifQ&s",
    "category": "Marketing"
  },
  {
    "skillId": 7,
    "skillName": "Yoga for Beginners",
    "providerName": "Anita Sharma",
    "providerEmail": "anita@skillswap.com",
    "price": 12,
    "rating": 4.7,
    "slotsAvailable": 8,
    "description": "Gentle yoga for flexibility and health.",
    "full_descriptions": "This beginner yoga program focuses on improving flexibility, posture, and mental relaxation. Sessions include warm-up exercises, basic yoga poses, breathing techniques, and guided relaxation. The instructor emphasizes correct posture and safe movements to avoid injury. The course is suitable for all ages and fitness levels, including those with sedentary lifestyles. Regular practice helps reduce stress, improve balance, and increase overall well-being. Each session ends with mindfulness practices to calm the mind. Students are encouraged to build a daily yoga habit for long-term health benefits.",
    "image": "https://i.ytimg.com/vi/v7AYKMP6rOE/maxresdefault.jpg",
    "category": "Health & Fitness"
  },
  {
    "skillId": 8,
    "skillName": "Basic Cooking Skills",
    "providerName": "Robert King",
    "providerEmail": "robert@skillswap.com",
    "price": 14,
    "rating": 4.3,
    "slotsAvailable": 6,
    "description": "Learn everyday home cooking.",
    "full_descriptions": "This basic cooking course teaches essential kitchen skills for beginners and busy individuals. Learners are introduced to kitchen safety, knife handling, and ingredient preparation. The course covers simple recipes, basic spices, cooking techniques, and time-saving tips. Students learn how to cook balanced meals using easily available ingredients. Practical demonstrations help learners understand flavor combinations and cooking methods. The instructor also shares tips on meal planning and reducing food waste. By the end, students can confidently prepare everyday meals at home.",
    "image": "https://i.ibb.co.com/G4N6XwGW/Skills.jpg",
    "category": "Cooking"
  },
  {
    "skillId": 9,
    "skillName": "Public Speaking Fundamentals",
    "providerName": "Daniel White",
    "providerEmail": "daniel@skillswap.com",
    "price": 19,
    "rating": 4.6,
    "slotsAvailable": 5,
    "description": "Overcome fear of public speaking.",
    "full_descriptions": "This public speaking fundamentals course helps learners overcome stage fear and communicate confidently. The program covers speech structure, voice modulation, body language, and audience engagement techniques. Students practice short speeches and presentations in a supportive environment. Constructive feedback helps identify strengths and areas for improvement. The instructor also teaches techniques to manage nervousness and build confidence. This course is suitable for students, professionals, and anyone who wants to improve their communication skills in meetings, interviews, or presentations.",
    "image": "https://i.ibb.co.com/jkBNNSpt/hq720.jpg",
    "category": "Communication"
  },
  {
    "skillId": 10,
    "skillName": "Basic Graphic Design",
    "providerName": "Laura Green",
    "providerEmail": "laura@skillswap.com",
    "price": 23,
    "rating": 4.5,
    "slotsAvailable": 4,
    "description": "Design basics using modern tools.",
    "full_descriptions": "This graphic design course introduces beginners to visual design principles and creative thinking. Learners explore color theory, typography, layout design, and branding basics. The course uses beginner-friendly tools to create posters, social media graphics, and simple logos. Practical exercises help students understand balance, contrast, and visual hierarchy. The instructor shares industry tips and design inspiration sources. By the end, learners can create clean and attractive designs suitable for personal or small business use.",
    "image": "https://i.ibb.co.com/vvCvVnTS/images-q-tbn-ANd9-Gc-QDg-Dk-KJQZ2-ALUq6-BKm-Pt-Fkmj-YD5-Pl4q-Zsoi-Q-s.jpg",
    "category": "Design"
  },
  {
    "skillId": 11,
    "skillName": "Mathematics for High School",
    "providerName": "Kevin Thomas",
    "providerEmail": "kevin@skillswap.com",
    "price": 16,
    "rating": 4.7,
    "slotsAvailable": 7,
    "description": "Strengthen core math concepts.",
    "full_descriptions": "This high school mathematics course helps students strengthen their understanding of core concepts. Topics include algebra, geometry, basic trigonometry, and problem-solving strategies. Lessons focus on clarity, step-by-step explanations, and exam-oriented practice. The instructor identifies common mistakes and explains how to avoid them. Regular practice questions and doubt-clearing sessions are included. This course is ideal for students preparing for exams or wanting to improve their mathematical confidence and logical thinking skills.",
    "image": "https://i.ibb.co.com/0vKJsPk/images-q-tbn-ANd9-Gc-Ql1-w-Mph-RBDcase-D1-AGnpr3ygy-QXNjlw-KO1-Q-s.jpg",
    "category": "Education"
  },
  {
    "skillId": 12,
    "skillName": "Resume Writing & Interview Prep",
    "providerName": "Sophia Miller",
    "providerEmail": "sophia@skillswap.com",
    "price": 28,
    "rating": 4.8,
    "slotsAvailable": 3,
    "description": "Get job-ready with expert guidance.",
    "full_descriptions": "This career preparation course focuses on building strong resumes and interview skills. Learners are guided on structuring resumes, highlighting achievements, and tailoring content for different job roles. The course also includes mock interviews, common interview questions, and professional communication tips. The instructor provides personalized feedback to improve confidence and presentation. Practical examples from real hiring scenarios are discussed. This course is ideal for fresh graduates and job seekers aiming to improve their chances of landing interviews and job offers.",
    "image": "https://i.ibb.co.com/QRYLpZv/write-edit-and-design-professional-resume-cv-and-cover-letter.jpg",
    "category": "Career"
  },
  {
    "skillId": 13,
    "skillName": "Time Management Skills",
    "providerName": "James Anderson",
    "providerEmail": "james@skillswap.com",
    "price": 10,
    "rating": 4.4,
    "slotsAvailable": 10,
    "description": "Manage time effectively and reduce stress.",
    "full_descriptions": "This time management course helps learners organize their daily tasks and improve productivity. The program introduces goal setting, prioritization techniques, and planning tools. Learners discover how to identify time-wasting habits and replace them with effective routines. Practical strategies such as scheduling, task batching, and focus improvement are covered. The instructor shares real-life examples and simple exercises. By applying these methods, students can reduce stress, meet deadlines, and maintain a healthier work-life balance.",
    "image": "https://i.ibb.co.com/Qs9bX35/images-q-tbn-ANd9-Gc-R33-Azbpl-c-Gnz-Ti-KB7f6-I6-Tj-Od0-Nqv9py75g-s.jpg",
    "category": "Personal Development"
  },
  {
    "skillId": 14,
    "skillName": "Mobile App UI Design",
    "providerName": "Nina Patel",
    "providerEmail": "nina@skillswap.com",
    "price": 27,
    "rating": 4.7,
    "slotsAvailable": 4,
    "description": "Design user-friendly mobile interfaces.",
    "full_descriptions": "This mobile UI design course teaches learners how to design intuitive and visually appealing app interfaces. Topics include user experience basics, wireframing, layout consistency, and design systems. Students work with modern design tools to create mobile app screens and prototypes. The instructor emphasizes usability, accessibility, and real-world design practices. Practical assignments help learners build a small portfolio. By the end of the course, students can confidently design mobile app interfaces suitable for real projects.",
    "image": "https://i.ibb.co.com/nNvCDq86/images-q-tbn-ANd9-Gc-Qducdz-IXhz3vk-Af-Qvu-Dt4ce4-L6ke3-ALIm-TA-s.jpg",
    "category": "UI/UX"
  },
  {
    "skillId": 15,
    "skillName": "Basic Financial Planning",
    "providerName": "William Scott",
    "providerEmail": "william@skillswap.com",
    "price": 17,
    "rating": 4.5,
    "slotsAvailable": 6,
    "description": "Manage personal finances wisely.",
    "full_descriptions": "This basic financial planning course helps individuals understand how to manage money effectively. Topics include budgeting, saving strategies, expense tracking, and basic investment concepts. The instructor explains financial terms in simple language with practical examples. Learners are guided on setting financial goals and making informed decisions. The course is suitable for students, young professionals, and families. By applying these principles, learners can develop better financial habits and plan for a more secure future.",
    "image": "https://i.ibb.co.com/9HRyQLMh/Top-10-reasons-to-consider-a-Financial-Management-Course.jpg",
    "category": "Finance"
  }
]
